import streamlit as st
import pandas as pd
import numpy as np

st.title("南宁美食🍛")
st.header("南宁美食地图🍰",help='详细内容')

map_data={
    'latitude':[23.096832,22.798278,22.817690,22.847565,23.156355],
    'longitude':[108.301585,108.337854,108.321063,108.268926,108.237124],
    }
st.map(pd.DataFrame(map_data))

data = {
    '永盛粉店🍜':[200, 150, 180,120,145,125,133,178,165,188,179,135],
    '舒记粉店(桃源店)🥢':[120, 160, 123,165,189,124,125,145,123,156,158,158],
    '味芙恬蛋糕店🍨':[110, 100, 160,120,130,164,157,159,211,230,146,145],
    '水果天空(七星店)🍇':[200, 210, 215,195,189,178,189,186,185,145,165,145],
    '麦当劳(南宁北站店)🥞':[300, 256, 250,145,155,233,146,146,198,168,250,146]
}

df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series(['01月','02月', '03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'], name='月份')
# 将新索引应用到数据框上
df.index = index

st.header("门店数据")
#展示数据
st.table(df)
#柱形图
st.line_chart(df)
#柱形图
st.bar_chart(df)
#面积图
st.area_chart(df)




